def eat(node):
    # if 노드의 왼쪽에 선택된 애가 없다면, 왼쪽 노드의 자식 다 먹기
    # if 노드의 오른쪽에 선택된 애가 있다면, pass
    



num = [      12 ,       30 ,     1 ,       8 ,     8 ,      6 ,     20      ,7       ,5      ,10      , 4         ,1]
links = [[-1, -1], [-1, -1], [-1, -1], [-1, -1], [8, 5], [2, 10], [3, 0], [6, 1], [11, -1], [7, 4], [-1, -1], [-1, -1]]
# index = [   0          1         2         3        4       5       6      7        8        9        10       11]


i=4
[8 5 11 2 10]

i = 5
[2 10 ]

i = 6
[3 0 ]

i = 7
[6 1 3 0]

ate(i) = tmp =[8,5]
ate(i). ate(tmp[0]) 


